import { useEffect, useRef } from "react";
import HomeModal from "../../components/homeModal.jsx";
import PhotoSwiper from "../../components/IndexSwiper.jsx";

export default function Index(){
    const openCommentModal = (modalId) => {
        const modal = new bootstrap.Modal(document.getElementById(modalId));
        modal.show();
    }

    const closeCommentModal = (modalId) => {
        const modalElement = document.getElementById(modalId);
        const modal = bootstrap.Modal.getInstance(modalElement); // 獲取已存在的實例
        if (modal) modal.hide();
    }

    return(<>
    

<main className="index">
    {/* <!-- banner --> */}
    <section className="indexBanner"
        style={{backgroundImage: 'url(./images/happy-elderly-couple-sitting-tropical-beach-back-view.png)'}}>
        <div className="container">
            <h3 className="fs-lg-0 text-white">
            {/* <!-- logo svg --> */}
            <svg className="logoIcon" width="80" height="29" viewBox="0 0 100 37" fill="none"
                xmlns="http://www.w3.org/2000/svg" >
                <g clipPath="url(#clip0_48_2790)" >
                <path
                  d="M0 18.125C0 8.25966 7.89488 0.257812 17.6284 0.257812C27.3618 0.257812 35.2567 8.25966 35.2567 18.125C35.2567 27.9904 27.3618 35.9923 17.6284 35.9923C7.89488 35.9923 0 27.9904 0 18.125ZM17.6284 34.6174C26.6147 34.6174 33.9003 27.2332 33.9003 18.125C33.9003 9.01689 26.6147 1.63263 17.6284 1.63263C8.64198 1.63263 1.35644 9.01689 1.35644 18.125C1.35644 27.2332 8.64198 34.6174 17.6284 34.6174Z"
                  fill="white" />
                <path
                  d="M22.0049 16.154H19.5729V13.689C19.5729 13.4205 19.3557 13.195 19.0854 13.195H16.1659C15.901 13.195 15.6785 13.4152 15.6785 13.689V16.154H13.2464C12.9815 16.154 12.7589 16.3742 12.7589 16.6481V19.6072C12.7589 19.8757 12.9762 20.1013 13.2464 20.1013H15.6785V22.5663C15.6785 22.8348 15.8957 23.0603 16.1659 23.0603H19.0854C19.3504 23.0603 19.5729 22.8402 19.5729 22.5663V20.1013H22.0049C22.2699 20.1013 22.4924 19.8811 22.4924 19.6072V16.6481C22.4924 16.3796 22.2752 16.154 22.0049 16.154ZM21.5175 19.1131H19.0854C18.8205 19.1131 18.598 19.3333 18.598 19.6072V22.0722H16.6534V19.6072C16.6534 19.3387 16.4361 19.1131 16.1659 19.1131H13.7339V17.1422H16.1659C16.4308 17.1422 16.6534 16.922 16.6534 16.6481V14.1831H18.598V16.6481C18.598 16.9166 18.8152 17.1422 19.0854 17.1422H21.5175V19.1131ZM26.6253 13.689H22.0049V9.00608C22.0049 7.92127 21.1307 7.03516 20.0604 7.03516H15.1963C14.126 7.03516 13.2517 7.92127 13.2517 9.00608V13.689H8.63135C7.56103 13.689 6.68677 14.5752 6.68677 15.66V20.59C6.68677 21.6748 7.56103 22.5609 8.63135 22.5609H13.2517V27.2439C13.2517 28.3287 14.126 29.2148 15.1963 29.2148H20.0604C21.1307 29.2148 22.0049 28.3287 22.0049 27.2439V22.5609H26.6253C27.6956 22.5609 28.5699 21.6748 28.5699 20.59V15.66C28.5699 14.5752 27.6956 13.689 26.6253 13.689ZM27.6002 20.59C27.6002 21.1324 27.1605 21.5781 26.6253 21.5781H21.5175C21.2526 21.5781 21.03 21.7983 21.03 22.0722V27.2492C21.03 27.7916 20.5902 28.2374 20.0551 28.2374H15.191C14.6558 28.2374 14.216 27.7916 14.216 27.2492V22.0722C14.216 21.8037 13.9988 21.5781 13.7286 21.5781H8.62075C8.08559 21.5781 7.64581 21.1324 7.64581 20.59V15.66C7.64581 15.1176 8.08559 14.6718 8.62075 14.6718H13.7286C13.9935 14.6718 14.216 14.4516 14.216 14.1777V9.00071C14.216 8.4583 14.6558 8.01256 15.191 8.01256H20.0551C20.5902 8.01256 21.03 8.4583 21.03 9.00071V14.1777C21.03 14.4463 21.2473 14.6718 21.5175 14.6718H26.6253C27.1605 14.6718 27.6002 15.1176 27.6002 15.66V20.59ZM7.41267 9.98886C7.41267 9.72034 7.62991 9.49479 7.90014 9.49479H9.11881V8.2596C9.11881 7.99108 9.33605 7.76553 9.60628 7.76553C9.87651 7.76553 10.0938 7.98571 10.0938 8.2596V9.49479H11.3124C11.5774 9.49479 11.7999 9.71497 11.7999 9.98886C11.7999 10.2627 11.5827 10.4829 11.3124 10.4829H10.0938V11.7181C10.0938 11.9866 9.87651 12.2122 9.60628 12.2122C9.33605 12.2122 9.11881 11.992 9.11881 11.7181V10.4829H7.90014C7.63521 10.4829 7.41267 10.2627 7.41267 9.98886ZM23.4621 9.98886C23.4621 9.72034 23.6793 9.49479 23.9495 9.49479H25.1682V8.2596C25.1682 7.99108 25.3854 7.76553 25.6557 7.76553C25.9259 7.76553 26.1431 7.98571 26.1431 8.2596V9.49479H27.3618C27.6267 9.49479 27.8493 9.71497 27.8493 9.98886C27.8493 10.2627 27.632 10.4829 27.3618 10.4829H26.1431V11.7181C26.1431 11.9866 25.9259 12.2122 25.6557 12.2122C25.3854 12.2122 25.1682 11.992 25.1682 11.7181V10.4829H23.9495C23.6846 10.4829 23.4621 10.2627 23.4621 9.98886ZM11.7893 26.2557C11.7893 26.5242 11.5721 26.7498 11.3018 26.7498H10.0832V27.985C10.0832 28.2535 9.86591 28.479 9.59569 28.479C9.32546 28.479 9.10822 28.2589 9.10822 27.985V26.7498H7.88954C7.62462 26.7498 7.40208 26.5296 7.40208 26.2557C7.40208 25.9818 7.61932 25.7616 7.88954 25.7616H9.10822V24.5265C9.10822 24.2579 9.32546 24.0324 9.59569 24.0324C9.86591 24.0324 10.0832 24.2526 10.0832 24.5265V25.7616H11.3018C11.5668 25.7616 11.7893 25.9818 11.7893 26.2557ZM27.8387 26.2557C27.8387 26.5242 27.6214 26.7498 27.3512 26.7498H26.1325V27.985C26.1325 28.2535 25.9153 28.479 25.6451 28.479C25.3748 28.479 25.1576 28.2589 25.1576 27.985V26.7498H23.9389C23.674 26.7498 23.4515 26.5296 23.4515 26.2557C23.4515 25.9818 23.6687 25.7616 23.9389 25.7616H25.1576V24.5265C25.1576 24.2579 25.3748 24.0324 25.6451 24.0324C25.9153 24.0324 26.1325 24.2526 26.1325 24.5265V25.7616H27.3512C27.6161 25.7616 27.8387 25.9818 27.8387 26.2557Z"
                  fill="white" />
                <path
                  d="M52.4517 30.348C51.8636 31.5349 51.2543 32.8721 50.6131 34.3651H50.4807L48.5732 30.348V33.5219C48.5732 33.7582 48.5944 33.914 48.6421 33.9784C48.6897 34.0429 48.7798 34.0804 48.907 34.0912L49.2461 34.1127V34.3221C48.8805 34.306 48.6103 34.3006 48.4301 34.3006C48.2341 34.3006 47.9532 34.306 47.5876 34.3221V34.1127L47.9479 34.0804C48.0539 34.0697 48.1334 34.0429 48.1811 33.9945C48.2341 33.9462 48.2606 33.7904 48.2606 33.5219V30.3534C48.2606 30.1064 48.2341 29.9506 48.1864 29.8862C48.1334 29.8217 48.038 29.7841 47.895 29.7788L47.5929 29.7627V29.5532C47.9321 29.5693 48.1546 29.5747 48.2553 29.5747C48.3718 29.5747 48.5944 29.5693 48.907 29.5532L50.7032 33.334L52.4517 29.5532C52.7644 29.5693 52.9869 29.5747 53.1141 29.5747C53.2571 29.5747 53.4744 29.5693 53.7711 29.5532V29.7627L53.4585 29.7788C53.2783 29.7895 53.1723 29.8379 53.1406 29.9345C53.1141 30.0258 53.0982 30.1654 53.0982 30.3534V33.5219C53.0982 33.7582 53.1194 33.914 53.167 33.9784C53.2147 34.0429 53.3048 34.0804 53.432 34.0912L53.7711 34.1127V34.3221C53.4161 34.306 53.0823 34.3006 52.7749 34.3006C52.5312 34.3006 52.2345 34.306 51.8848 34.3221V34.1127C52.1444 34.1019 52.3034 34.0643 52.3617 33.9999C52.4252 33.9354 52.4517 33.7797 52.4517 33.5219V30.348Z"
                  fill="white" />
                <path
                  d="M54.7938 32.8291C54.7938 32.3136 54.9421 31.9 55.2441 31.5832C55.5461 31.2663 55.9647 31.1052 56.4946 31.1052C56.945 31.1052 57.3159 31.2502 57.6073 31.5349C57.8987 31.8249 58.0418 32.1847 58.0418 32.625C58.0418 33.1245 57.8775 33.5434 57.5437 33.8763C57.2152 34.2039 56.7966 34.3704 56.2879 34.3704C55.8641 34.3704 55.5091 34.2308 55.2229 33.9515C54.9368 33.6723 54.7885 33.2963 54.7885 32.8291H54.7938ZM55.4031 32.5069C55.4031 32.9634 55.4985 33.35 55.6945 33.6723C55.8906 33.9891 56.1714 34.1502 56.5423 34.1502C56.7913 34.1502 57.0033 34.0428 57.1781 33.8334C57.353 33.6239 57.4377 33.3178 57.4377 32.9258C57.4377 32.4639 57.3318 32.088 57.1251 31.7819C56.9185 31.4812 56.6589 31.3254 56.3515 31.3254C56.0442 31.3254 55.8111 31.4274 55.6468 31.6315C55.4879 31.8356 55.4084 32.1256 55.4084 32.5069H55.4031Z"
                  fill="white" />
                <path
                  d="M61.2845 31.3684V31.1697C61.5706 31.1804 61.7772 31.1912 61.9203 31.1912C62.0634 31.1912 62.27 31.1858 62.5561 31.1697V31.3684L62.3336 31.3791C62.2541 31.3791 62.1852 31.4436 62.1163 31.5617C62.0528 31.6799 61.9521 31.8839 61.8249 32.1686C61.507 32.856 61.205 33.581 60.9189 34.3382H60.5798L59.4618 31.653C59.4247 31.5725 59.3876 31.5134 59.3558 31.4597C59.324 31.4113 59.2657 31.3845 59.1756 31.3791L58.9955 31.363V31.1643C59.3293 31.175 59.5836 31.1858 59.7638 31.1858C59.8962 31.1858 60.1612 31.1804 60.5745 31.1643V31.363L60.2883 31.3738C60.1453 31.3738 60.0711 31.4275 60.0711 31.5188C60.0711 31.5778 60.0976 31.6638 60.1453 31.7819L60.9189 33.7206C61.0036 33.5219 61.1149 33.2588 61.2527 32.9365C61.3904 32.6143 61.5176 32.2813 61.6342 31.943C61.6925 31.7658 61.7242 31.6208 61.7242 31.5134C61.7242 31.4221 61.6501 31.3738 61.507 31.3684H61.2898H61.2845Z"
                  fill="white" />
                <path
                  d="M64.2357 32.7217C64.2357 33.1299 64.3417 33.4467 64.5589 33.6723C64.7762 33.8978 65.0729 34.0106 65.4491 34.0106C65.661 34.0106 65.9419 33.8978 66.2969 33.6776L66.387 33.7421L66.2545 33.9784C66.1326 34.0858 65.9631 34.1771 65.7405 34.2576C65.5233 34.3328 65.3378 34.3704 65.1842 34.3704C64.6649 34.3704 64.2728 34.2254 64.0132 33.9408C63.7536 33.6508 63.6211 33.2802 63.6211 32.8237C63.6211 32.2169 63.8012 31.7765 64.1668 31.5026C64.5324 31.2341 64.8663 31.0999 65.1683 31.0999C65.5498 31.0999 65.8624 31.2126 66.0955 31.4436C66.3287 31.6691 66.4505 31.9699 66.4505 32.3404C66.4505 32.4693 66.4452 32.5606 66.4346 32.625C66.0584 32.6895 65.661 32.7163 65.2584 32.7163H64.2357V32.7217ZM64.2516 32.4639C64.506 32.48 64.7762 32.4908 65.0729 32.4908C65.3113 32.4908 65.571 32.48 65.8412 32.4639C65.8412 32.1149 65.7776 31.841 65.6504 31.6369C65.5233 31.4328 65.3484 31.3308 65.1206 31.3308C64.8928 31.3308 64.6861 31.4221 64.5113 31.5993C64.3364 31.7765 64.2516 32.0665 64.2516 32.4639Z"
                  fill="white" />
                <path
                  d="M71.4047 34.3436H71.0921L70.3715 31.9484C70.2973 31.7174 70.2337 31.5671 70.1807 31.4973C70.1278 31.4274 70.043 31.3845 69.9211 31.3684H69.7675V31.1697C70.0854 31.1804 70.345 31.1912 70.5411 31.1912C70.6841 31.1912 70.9649 31.1858 71.3729 31.1697V31.3684L71.0603 31.3899C70.9172 31.4006 70.8484 31.4597 70.8484 31.5671C70.8484 31.6047 70.8696 31.6906 70.9066 31.8302L71.4365 33.5702L72.5121 31.1106H72.6711L73.6672 33.6293C73.8791 33.0815 74.0487 32.6358 74.1812 32.2867C74.3136 31.943 74.3772 31.7174 74.3772 31.6154C74.3772 31.4758 74.303 31.4006 74.16 31.3899L73.8897 31.3684V31.1697C74.2289 31.1804 74.4461 31.1912 74.5415 31.1912C74.6368 31.1912 74.8647 31.1858 75.2091 31.1697V31.3684L75.0554 31.3791C74.9018 31.3845 74.7481 31.5778 74.5892 31.9484C74.4991 32.1739 74.3666 32.4961 74.1918 32.9097C74.0222 33.3232 73.8474 33.8012 73.6725 34.3436H73.3599L72.4114 32.0182C72.0723 32.7647 71.7332 33.538 71.3888 34.3436H71.4047Z"
                  fill="white" />
                <path
                  d="M77.249 31.1053L77.3126 31.1267V33.5971C77.3126 33.769 77.3232 33.8925 77.3391 33.9623C77.355 34.0321 77.4186 34.0751 77.5246 34.0912L77.8637 34.1127V34.3114C77.514 34.3006 77.2438 34.2899 77.053 34.2899C76.8252 34.2899 76.539 34.2953 76.1893 34.3114V34.1127L76.4808 34.0966C76.5814 34.0912 76.6503 34.0643 76.6874 34.0214C76.7245 33.973 76.7457 33.8388 76.7457 33.6132V32.029C76.7457 31.9806 76.7404 31.9001 76.7298 31.7766C76.7192 31.653 76.6397 31.594 76.4914 31.594H76.1946V31.3953C76.5549 31.3577 76.9046 31.2664 77.249 31.1106V31.1053ZM77 29.5962C77.106 29.5962 77.1908 29.6338 77.2649 29.709C77.3391 29.7842 77.3762 29.8755 77.3762 29.9829C77.3762 30.0903 77.3391 30.1762 77.2649 30.246C77.1908 30.3158 77.106 30.3534 77 30.3534C76.894 30.3534 76.8093 30.3158 76.7351 30.2406C76.6609 30.1655 76.6238 30.0742 76.6238 29.9721C76.6238 29.8701 76.6609 29.7788 76.7351 29.7036C76.8146 29.6284 76.8993 29.5908 77 29.5908V29.5962Z"
                  fill="white" />
                <path
                  d="M80.8204 31.3148L80.7568 31.6692H79.8666V33.5005C79.8666 33.7959 79.9991 33.9463 80.264 33.9463C80.3912 33.9463 80.5077 33.9033 80.619 33.812L80.7091 33.9248L80.3647 34.3222C80.2322 34.3598 80.0944 34.3759 79.962 34.3759C79.5169 34.3759 79.2944 34.1127 79.2944 33.5918V31.6692L78.7804 31.6907V31.5403L79.2997 31.3094C79.305 31.1913 79.3103 31.0731 79.3103 30.9603C79.3103 30.7079 79.2997 30.4931 79.2732 30.3105C79.4639 30.2568 79.6547 30.1709 79.856 30.0474L79.9355 30.1118C79.8878 30.579 79.8613 30.9335 79.8613 31.1751V31.3309L80.8098 31.3094L80.8204 31.3148Z"
                  fill="white" />
                <path
                  d="M85.4247 34.3113C85.181 34.3006 85.0008 34.2899 84.8843 34.2899C84.6829 34.2899 84.4975 34.2952 84.3279 34.3113V32.3995C84.3279 32.1202 84.2537 31.9108 84.116 31.755C83.9729 31.6047 83.7928 31.5295 83.5596 31.5295C83.3477 31.5295 83.1569 31.5993 82.9874 31.7389C82.8178 31.8786 82.733 32.0128 82.733 32.1363V33.5756C82.733 33.7636 82.7436 33.8924 82.7648 33.9676C82.786 34.0428 82.8602 34.0804 82.9874 34.0912L83.2841 34.1126V34.3113C82.9344 34.3006 82.6642 34.2899 82.4734 34.2899C82.2509 34.2899 81.9594 34.2952 81.6097 34.3113V34.1126L81.8641 34.0912C81.9859 34.0804 82.0654 34.0536 82.1025 34.0052C82.1396 33.9515 82.1608 33.8119 82.1608 33.5756V30.203C82.1608 30.0043 82.1449 29.8862 82.1131 29.8432C82.0866 29.8002 82.023 29.7787 81.9277 29.7787H81.6097V29.58C82.0283 29.5317 82.3833 29.4458 82.6642 29.3169L82.7277 29.3813V31.7497L83.2152 31.2986C83.3583 31.1697 83.549 31.1052 83.7928 31.1052C84.1637 31.1052 84.4392 31.2019 84.6193 31.4006C84.7995 31.5939 84.8896 31.8839 84.8896 32.2652V33.5756C84.8896 33.785 84.9002 33.9193 84.9266 33.9837C84.9531 34.0482 85.0273 34.0804 85.1598 34.0912L85.4194 34.1126V34.3113H85.4247Z"
                  fill="white" />
                <path
                  d="M90.665 29.7627L90.3895 29.7788C90.1828 29.7895 90.0663 29.8379 90.0345 29.9291C90.008 30.0204 89.9921 30.1601 89.9921 30.3534V33.6562C89.9921 34.3006 89.8384 34.7893 89.5311 35.1169C89.2238 35.4445 88.9165 35.6056 88.6092 35.6056C88.5562 35.6056 88.5138 35.6056 88.482 35.5895L88.4502 35.0525L88.5244 35.0149C88.5986 35.0686 88.678 35.1008 88.7628 35.1277C88.8529 35.1491 88.9271 35.1599 88.9959 35.1599C89.1072 35.1599 89.1973 35.1116 89.2556 35.0203C89.3192 34.929 89.351 34.7141 89.351 34.3758V30.348C89.351 30.1279 89.3351 29.9775 89.3033 29.9023C89.2715 29.8271 89.1814 29.7841 89.0277 29.7734L88.6833 29.7519V29.5425C89.0383 29.5586 89.3722 29.564 89.6795 29.564C89.9868 29.564 90.3206 29.5586 90.6756 29.5425V29.7519L90.665 29.7627Z"
                  fill="white" />
                <path
                  d="M91.6929 32.8291C91.6929 32.3136 91.8413 31.9 92.1433 31.5832C92.4453 31.2663 92.8639 31.1052 93.3938 31.1052C93.8441 31.1052 94.215 31.2502 94.5065 31.5349C94.7979 31.8249 94.9409 32.1847 94.9409 32.625C94.9409 33.1245 94.7767 33.5434 94.4429 33.8763C94.1144 34.2039 93.6958 34.3704 93.1871 34.3704C92.7632 34.3704 92.4082 34.2308 92.1221 33.9515C91.836 33.6723 91.6876 33.2963 91.6876 32.8291H91.6929ZM92.3023 32.5069C92.3023 32.9634 92.3976 33.35 92.5937 33.6723C92.7897 33.9891 93.0705 34.1502 93.4414 34.1502C93.6905 34.1502 93.9024 34.0428 94.0773 33.8334C94.2521 33.6239 94.3369 33.3178 94.3369 32.9258C94.3369 32.4639 94.2309 32.088 94.0243 31.7819C93.8177 31.4812 93.558 31.3254 93.2507 31.3254C92.9434 31.3254 92.7103 31.4274 92.546 31.6315C92.387 31.8356 92.3076 32.1256 92.3076 32.5069H92.3023Z"
                  fill="white" />
                <path
                  d="M96.0219 36.1373L96.1809 35.6056H96.271C96.3769 35.7238 96.4935 35.7882 96.626 35.7882C96.8856 35.7882 97.1081 35.5358 97.2989 35.031L97.5108 34.4725L96.3875 31.7121C96.3134 31.5188 96.2074 31.4113 96.0749 31.3952L95.9213 31.3684V31.1697C96.2498 31.1804 96.5041 31.1912 96.6896 31.1912C96.7955 31.1912 97.0658 31.1858 97.4949 31.1697V31.3684L97.2247 31.3845C97.0869 31.3952 97.0181 31.4489 97.0181 31.551C97.0181 31.6369 97.1134 31.943 97.3042 32.4639C97.4949 32.9849 97.6751 33.4038 97.8446 33.7206L98.5653 31.9376C98.65 31.7389 98.6924 31.6154 98.6924 31.5671C98.6924 31.4597 98.6129 31.4006 98.454 31.3899L98.2314 31.3684V31.1697C98.4911 31.1804 98.6977 31.1912 98.8567 31.1912C98.9997 31.1912 99.2223 31.1858 99.519 31.1697V31.3684L99.3653 31.3791C99.2647 31.3791 99.1799 31.4328 99.1004 31.5402C99.0262 31.6423 98.9415 31.8034 98.8461 32.0182L97.4208 35.3425C97.2512 35.7399 97.0817 35.9869 96.9227 36.0943C96.7637 36.2017 96.5836 36.25 96.3822 36.25C96.2498 36.25 96.1332 36.2125 96.0272 36.1373H96.0219Z"
                  fill="white" />
                <path
                  d="M48.5573 5.33278C48.6315 7.29833 48.5573 9.66667 48.2818 11.2724C48.1334 12.1639 47.5029 12.5452 46.671 12.2659C45.8656 11.9867 45.6908 11.3476 45.9928 10.5044C46.4962 9.10278 46.8247 7.29296 47.026 5.22537C47.1002 4.68833 47.3757 4.38222 47.8314 4.40907C48.2606 4.43593 48.5361 4.76352 48.5626 5.32741L48.5573 5.33278ZM51.8053 1.305V22.9583C51.8053 23.823 51.302 24.2848 50.3694 24.2848C49.4369 24.2848 48.9123 23.8283 48.9123 22.9583V1.29963C48.9123 0.435 49.4422 0 50.3694 0C51.2967 0 51.8053 0.435 51.8053 1.29963V1.305ZM68.7873 8.59796C68.3369 9.66667 67.5792 9.84926 66.599 9.38741C65.7936 9.00611 65.0147 8.52278 64.31 7.93204C64.2358 8.38852 63.9603 8.6463 63.4569 8.6463H57.1675C56.6906 8.6463 56.4151 8.41537 56.3356 7.98574C55.2547 8.77519 54.1473 9.44111 53.0399 9.9513C52.563 10.1554 52.1868 10.0265 52.0067 9.61833C51.8265 9.21019 51.8795 8.82889 52.3352 8.54963C52.7114 8.3187 53.0664 8.0663 53.4161 7.80852C52.9127 7.80852 52.5365 7.45407 52.4359 6.815C52.3087 5.95037 52.1338 5.03204 51.8848 4.13519C51.7841 3.70019 51.9325 3.39407 52.2875 3.29204C52.6637 3.14167 52.9657 3.2437 53.1936 3.59815C53.6704 4.31241 54.0731 5.1287 54.4493 6.12222C54.55 6.35315 54.5977 6.5787 54.5977 6.7613C56.2085 5.20389 57.5437 3.21685 58.5981 1.07407C59.1015 0.0805556 59.8539 -0.177222 60.8129 0.230926C61.719 0.612222 61.8938 1.42852 61.5176 2.21796C63.2291 4.2587 65.3909 5.68722 67.7593 6.53037C68.8138 6.91167 69.1953 7.62593 68.7926 8.59796H68.7873ZM60.4102 11.5033V21.9326C60.4102 23.6672 58.5504 24.3063 56.5582 23.5115C56.182 23.3611 56.0283 23.0281 56.1078 22.6683C56.1555 22.3139 56.4098 22.1098 56.8602 22.1313C57.7662 22.1796 57.8934 21.9004 57.8934 21.2881V18.6889H55.7316V22.9744C55.7316 23.7156 55.2547 24.172 54.4493 24.172C53.6439 24.172 53.1936 23.7156 53.1936 22.9744V11.498C53.1936 10.5528 53.7234 10.0211 54.6507 10.0211H58.9531C59.8857 10.0211 60.4102 10.5581 60.4102 11.498V11.5033ZM57.8934 12.1156C57.8934 11.9383 57.7662 11.8094 57.5914 11.8094H56.0336C55.8587 11.8094 55.7316 11.9383 55.7316 12.1156V13.442H57.8934V12.1156ZM57.8934 15.2035H55.7316V16.965H57.8934V15.2035ZM57.6921 6.89019H63.1549C62.2223 5.92352 61.3693 4.80111 60.6646 3.59815C59.8115 4.82259 58.8048 5.91815 57.6974 6.89019H57.6921ZM67.3037 10.8965V21.4063C67.3037 23.9304 65.2425 24.6178 62.021 23.2698C61.5441 23.0657 61.3905 22.7328 61.4911 22.3031C61.6183 21.8681 61.9415 21.6909 62.4979 21.7661C64.3365 21.9702 64.6385 21.8413 64.6385 20.7994V10.9019C64.6385 10.0587 65.1154 9.60222 65.9737 9.60222C66.8321 9.60222 67.309 10.0587 67.309 10.9019L67.3037 10.8965ZM61.4911 18.8554V11.4067C61.4911 10.7193 61.8938 10.338 62.5985 10.338C63.3032 10.338 63.7324 10.7193 63.7324 11.4067V18.8554C63.7324 19.5428 63.3297 19.9241 62.5985 19.9241C61.8673 19.9241 61.4911 19.5428 61.4911 18.8554Z"
                  fill="white" />
                <path
                  d="M99.8506 21.5781C99.8242 22.6254 99.2466 23.2107 98.2134 23.2591C94.8912 23.4363 91.9505 23.4631 89.4548 23.3343C85.4544 23.157 83.2131 21.8574 82.1587 19.9187C82.0315 19.7146 81.8832 19.7146 81.7825 19.9456C81.2527 21.0143 80.4261 22.3407 79.52 23.2591C78.8418 23.9733 78.1371 24.0002 77.5331 23.3343C76.9025 22.6737 77.0297 21.9594 77.7609 21.2935C78.6405 20.5041 79.4723 19.6126 80.0234 18.8446V13.7159C80.0234 13.5387 79.8962 13.4098 79.7214 13.4098H78.2113C77.6337 13.4098 77.3317 13.0768 77.3317 12.5183C77.3317 11.9598 77.6337 11.6268 78.2113 11.6268H81.6606C82.6144 11.6268 83.1177 12.1639 83.1177 13.1306V18.3613C84.098 19.865 86.0638 20.6061 89.3065 20.6061C92.4009 20.633 95.3681 20.4772 98.1392 20.2248C99.2466 20.1228 99.8771 20.5793 99.8506 21.5781ZM77.8828 5.89129C78.1318 5.53685 78.4868 5.45629 78.9372 5.63889C79.9704 6.04703 81.3268 6.86333 82.3071 7.67963C83.1389 8.3187 83.2396 9.08129 82.5826 9.79555C81.9309 10.5367 81.1255 10.5098 80.442 9.66666C79.6366 8.59796 78.757 7.67963 78.0523 6.98685C77.6761 6.6324 77.6496 6.27259 77.8775 5.89129H77.8828ZM78.7888 2.16963C78.4391 1.78833 78.4126 1.45537 78.6405 1.07407C78.8683 0.741109 79.218 0.692776 79.6472 0.843146C80.7281 1.25129 81.9627 1.96555 82.8952 2.78185C83.6741 3.39407 83.8013 4.13518 83.1442 4.84944C82.4925 5.53685 81.7348 5.53685 81.0831 4.69907C80.3307 3.78074 79.5253 2.86241 78.7941 2.175L78.7888 2.16963ZM83.9973 16.9596C83.9973 16.4226 84.2993 16.1165 84.8504 16.1165H90.1596V15.0961H86.8373C85.8836 15.0961 85.3537 14.5859 85.3537 13.6193V9.28537C85.3537 8.3187 85.8836 7.78166 86.8373 7.78166H90.1596V6.86333H85.8571C85.3273 6.86333 85.0252 6.53037 85.0252 5.9987C85.0252 5.59055 85.2266 5.28444 85.5763 5.20926C84.7444 5.10722 84.3205 4.65074 84.3205 3.80759V2.73889C84.3205 1.7937 84.8504 1.26203 85.7776 1.26203H97.6782C98.632 1.26203 99.1618 1.79907 99.1618 2.73889V3.80759C99.1618 4.62389 98.7115 5.10722 97.9061 5.1824C98.2558 5.28444 98.4571 5.59055 98.4571 5.9987C98.4571 6.55722 98.1551 6.86333 97.6252 6.86333H93.2486V7.78166H96.5443C97.4981 7.78166 98.0279 8.3187 98.0279 9.28537V13.6193C98.0279 14.5859 97.4981 15.0961 96.5443 15.0961H93.2486V16.1165H98.6585C99.1883 16.1165 99.5115 16.4226 99.5115 16.9596C99.5115 17.4967 99.183 17.8028 98.6585 17.8028H93.2486V19.0541C93.2486 19.9993 92.7188 20.4826 91.712 20.4826C90.7053 20.4826 90.1543 19.9993 90.1543 19.0541V17.8028H84.8451C84.294 17.8028 83.992 17.4967 83.992 16.9596H83.9973ZM90.1596 5.15018V4.61315C90.1596 3.66796 90.6894 3.18463 91.7173 3.18463C92.7453 3.18463 93.2539 3.66796 93.2539 4.61315V5.15018H97.1272C96.4966 4.99981 96.1205 4.53796 96.1205 3.79685V3.23833C96.1205 3.06111 95.9933 2.93222 95.8184 2.93222H87.6427C87.4679 2.93222 87.3407 3.06111 87.3407 3.23833V3.79685C87.3407 4.53796 86.991 4.99444 86.334 5.15018H90.1596ZM88.1991 10.585H90.2867V9.48944H88.5011C88.3262 9.48944 88.1991 9.61833 88.1991 9.79555V10.585ZM90.2867 13.4152V12.2176H88.1991V13.1091C88.1991 13.2863 88.3262 13.4152 88.5011 13.4152H90.2867ZM93.1056 9.48944V10.585H95.1932V9.79555C95.1932 9.61833 95.066 9.48944 94.8912 9.48944H93.1056ZM95.1932 12.2176H93.1056V13.4152H94.8912C95.066 13.4152 95.1932 13.2863 95.1932 13.1091V12.2176Z"
                  fill="white" />
                </g>
                <defs>
                    <clipPath id="clip0_48_2790">
                        <rect width="100" height="36.25" fill="white" />
                    </clipPath>
                </defs>
            </svg><br/>
            Move with Joy,<br/>
            Handle with Care
            </h3>
        </div>
        </section>
      {/* <!-- 推薦課程 --> */}
        <section className="news">
        <div className="container pt-7 pb-6 pb-lg-10">
          {/* <!-- 課程卡片 --> */}
            <div className="row gy-2 gy-lg-0">
            <div className="col-lg-4 position-relative">
                <a href="#" className="courseLink stretched-link">
                <div
                    className="cardText position-absolute top-0 vertical-rl bg-white pt-5 pb-3 ps-4 rounded rounded-bottom-right-0">
                    <h3 className="cardTitle lh-1 me-0 ms-3 fs-lg-2 text-primary">主打課程</h3>
                    <p className="cardContent mt-9 lh-1 mx-0 fs-5 fs-lg-4 text-nowrap">樂齡晨間操</p>
                </div>
                <div className="overflow-hidden mt-14 rounded">
                    <img className="img-fluid rounded" src="./images/athletic-senior-woman-stretching-arms-park.png"
                    alt="athletic-senior-woman" />
                </div>
                </a>
            </div>
            <div className="col-lg-4 position-relative">
                <a href="#" className="courseLink stretched-link">
                <div
                    className="cardText position-absolute top-0 vertical-rl bg-white pt-5 pb-3 ps-4 rounded rounded-bottom-right-0">
                    <h3 className="cardTitle lh-1 me-0 ms-3 fs-lg-2 text-primary">熱門課程</h3>
                    <p className="cardContent mt-9 lh-1 mx-0 fs-5 fs-lg-4 text-nowrap">有氧肌力見習班</p>
                </div>
                <div className="overflow-hidden mt-14 rounded">
                    <img className="img-fluid rounded" src="./images/grandparents-working-out-gym.png"
                    alt="grandparents-working-out-gym" />
                </div>
                </a>
            </div>
            <div className="col-lg-4 position-relative">
                <a href="#" className="courseLink stretched-link">
                <div
                    className="cardText position-absolute top-0 vertical-rl bg-white pt-5 pb-3 ps-4 rounded rounded-bottom-right-0">
                    <h3 className="cardTitle lh-1 me-0 ms-3 fs-lg-2 text-primary">最新活動</h3>
                    <p className="cardContent mt-9 lh-1 mx-0 fs-5 fs-lg-4 text-nowrap">樂活健康促進團</p>
                </div>
                <div className="overflow-hidden mt-14 rounded">
                    <img className="img-fluid rounded" src="./images/14811.png" alt="older-person-clapping" />
                </div>
                </a>
            </div>
            </div>
        </div>
        </section>
      {/* <!-- 精選課程 --> */}
        <section className="featureCourses mb-6 mb-lg-10">
        {/* <!-- 裝飾線及精選課程標題 --> */}
        <div className="container pb-6 pb-lg-10 ">
            <div className="position-relative decoLine"></div>
            <h3 className="fs-lg-1 mt-2 mt-lg-4">精選課程</h3>
        </div>
        {/* <!-- 課程卡片 --> */}
        <div className="bg-primary-1">
            <div className="container py-2 py-lg-5">
            <div className="row g-2 g-lg-6">
              {/* <!-- 左側 --> */}
                <div className="col-lg-6">
                <div className="row">
                    <div className="col-12 position-relative">
                    <a href="#" className="stretched-link"></a>
                    <div
                        className="cardTitle position-absolute vertical-rl bg-primary-1 py-2 ps-4 py-lg-5 ps-lg-5 rounded rounded-bottom-right-0">
                        <h3 className="lh-1 me-0 ms-0 fs-lg-1 text-primary">運動保健</h3>
                    </div>
                    <div className="cardText position-absolute bottom-0 bg-primary-1 rounded rounded-bottom-right-0">
                        <p className="me-0 ms-0 fs-5 text-neutral-1">
                        教授如何透過運動維護、促進健康，並且預防損傷。
                        </p>
                    </div>
                    <div
                        className="ms-0 my-9 ms-lg-10 mt-lg-13 mb-lg-24 ps-2 ps-lg-3 pt-2 pt-lg-3 border border-primary rounded-20 border-end-0 border-bottom-0">
                        <img className="rounded-20 img-fluid" src="./images/senior-people-doing-cardio.png"
                        alt="senior-people-doing-cardio" />
                    </div>
                    </div>
                    <div className="col-12 position-relative">
                    <a href="#" className="stretched-link"></a>
                    <div
                        className="cardTitle position-absolute  vertical-rl bg-primary-1 py-2 ps-4 py-lg-5 ps-lg-5 rounded rounded-bottom-right-0">
                        <h3 className="lh-1 me-0 ms-0 fs-lg-1 text-primary">生活技能</h3>
                    </div>
                    <div className="cardText position-absolute bottom-0 bg-primary-1 rounded rounded-bottom-right-0">
                        <p className="me-0 ms-0 fs-5 text-neutral-1">
                        鼓勵銀髮族學習新知，保持活力和社會聯繫。
                        </p>
                    </div>
                    <div
                        className="ms-0 my-9 ms-lg-10 mt-lg-13 mb-lg-24 ps-2 ps-lg-3 pt-2 pt-lg-3 border border-primary rounded-20 border-end-0 border-bottom-0">
                        <img className="rounded-20 img-fluid"
                        src="./images/man-using-mobile-phone-while-sitting-table (1).png"
                        alt="man-using-mobile-phone-while-sitting-table" />
                    </div>
                    </div>
                </div>
                </div>
              {/* <!-- 右側 --> */}
            <div className="col-lg-6">
                <div className="row">
                <div className="col-12 position-relative mt-0 mt-lg-30">
                    <a href="#" className="stretched-link"></a>
                    <div
                    className="cardTitle position-absolute vertical-rl bg-primary-1 py-2 ps-4 py-lg-5 ps-lg-5 rounded rounded-bottom-right-0">
                    <h3 className="lh-1 me-0 ms-0 fs-lg-1 text-primary">心靈成長</h3>
                    </div>
                    <div className="cardText position-absolute bottom-0 bg-primary-1 rounded rounded-bottom-right-0">
                    <p className="me-0 ms-0 fs-5 text-neutral-1">
                        引導學生去探索自我、增強心理韌性及提升情感智慧。
                    </p>
                    </div>
                    <div
                    className="ms-0 my-9 ms-lg-10 mt-lg-13 mb-lg-24 ps-2 ps-lg-3 pt-2 pt-lg-3 border border-primary rounded-20 border-end-0 border-bottom-0">
                    <img className="rounded-20 img-fluid"
                        src="./images/senior-elderly-man-reading-book-drinking-mug-coffee-garden.png"
                        alt="senior-elderly-man-reading-book-drinking-mug-coffee-garden"/>
                    </div>
                </div>
                <div className="col-12 position-relative">
                    <a href="#" className="stretched-link"></a>
                    <div
                    className="cardTitle position-absolute vertical-rl bg-primary-1 py-2 ps-4 py-lg-5 ps-lg-5 rounded rounded-bottom-right-0">
                    <h3 className="lh-1 me-0 ms-0 fs-lg-1 text-primary">社區活動</h3>
                    </div>
                    <div className="cardText position-absolute bottom-0 bg-primary-1 rounded rounded-bottom-right-0">
                    <p className="me-0 ms-0 fs-5 text-neutral-1">
                        鼓勵多社交互動，增強社區參與感，豐富晚年生活。
                    </p>
                    </div>
                    <div
                    className="ms-0 my-9 ms-lg-10 mt-lg-13 mb-lg-24 ps-2 ps-lg-3 pt-2 pt-lg-3 border border-primary rounded-20 border-end-0 border-bottom-0">
                    <img className="rounded-20 img-fluid" src="./images/17925.png" alt="athletic-senior-people"/>
                    </div>
                </div>
                </div>
            </div>
        </div>
        </div>
        </div>
    </section>
      {/* <!-- 知識分享 --> */}
    <section className="knowledgeSharing">
        {/* <!-- 裝飾線及精選課程標題 --> */}
        <div className="container pb-6 pb-lg-10 ">
            <div className="position-relative decoLine"></div>
            <h3 className="fs-lg-1 mt-2 mt-lg-4">知識分享</h3>
        </div>
        <div className="container">
          {/* <!-- 課程卡片 --> */}
            <div className="row gy-3 gx-lg-12 mb-6">
            <div className="col-lg-4 position-relative">
                <div className="cardTitle position-absolute top-0 end-0 vertical-rl bg-white p-4 rounded">
                <h3 className="lh-1 me-0 ms-0 fs-lg-2 text-primary">飲食健康</h3>
                </div>
                <div className="pt-lg-6 pe-lg-8 pb-2 pb-md-24">
                <img className="cardImg rounded img-fluid d-block mx-auto"
                    src="./images/salad-with-tomatoes-cheese-bowl-wooden-table-with-green-healthy-ingredients-healthy-food-concept.png"
                    alt="salad-with-tomatoes-cheese-bowl-wooden-table-with-green-healthy-ingredients-healthy-food-concept"/>
                </div>
              {/* <!-- 手機版卡片文字 --> */}
                <div className="bg-white mb-2 d-blcok d-md-none">
                <h5 className="text-primary mb-2">銀髮族必備三大營養素!</h5>
                <p className="fs-6 text-neutral-1 up-to-2-lines px-1">
                    為了不讓自己被年齡束縛，無論是50歲以上的熟齡族，還是超過65歲的銀髮族，每日三餐應正確攝取營養，為自己打造黃金營養力。營養師建議，熟齡族應注重均衡飲食，攝取足夠的蛋白質、纖維、維生素和礦物質，特別是鈣質與維生素D，以維護骨骼健康。避免高糖、高鹽、高脂食物，多選擇新鮮蔬果、全穀類和優質蛋白。這樣才能維持活力，延緩衰老，讓身體更健康、更有活力。
                </p>
                </div>
                <div className="d-flex flex-row-reverse border-bottom border-primary d-block d-md-none">
                <a href="#" className="learn-more-mobile text-primary fs-7 d-flex align-items-center mb-2">閱讀更多<svg
                    className="moreIcon" width="19" height="10" viewBox="0 0 24 24" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <path d="M22 7.45946L12 18L2 7.45946L4.33333 5L12 13.0811L19.6667 5L22 7.45946Z" fill="#E79776" />
                    </svg>
                </a>
                </div>
              {/* <!-- 電腦版卡片文字 --> */}
                <div
                className="cardText position-absolute bottom-0 bg-white rounded-20 rounded-top-left-0 d-none d-md-block vertical-rl p-5">
                <h6 className="text-primary ms-2 me-0">銀髮族必備三大營養素!</h6>
                <p className="fs-7 text-neutral-1 up-to-6-lines pt-7 ms-2 me-0">
                    為了不讓自己被年齡束縛，無論是50歲以上的熟齡族，還是超過65歲的銀髮族，每日三餐應正確攝取營養，為自己打造黃金營養力。營養師建議，熟齡族應注重均衡飲食，攝取足夠的蛋白質、纖維、維生素和礦物質，特別是鈣質與維生素D，以維護骨骼健康。避免高糖、高鹽、高脂食物，多選擇新鮮蔬果、全穀類和優質蛋白。這樣才能維持活力，延緩衰老，讓身體更健康、更有活力。
                </p>
                <a href="#" className="learn-more-H mt-auto">閱讀更多<svg className="moreIcon mt-2" width="19" height="10"
                    viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M22 7.45946L12 18L2 7.45946L4.33333 5L12 13.0811L19.6667 5L22 7.45946Z" fill="#484848" />
                    </svg>
                </a>
                </div>
            </div>
            <div className="col-lg-4 position-relative">
                <div className="cardTitle position-absolute top-0 end-0 vertical-rl bg-white p-4 rounded">
                <h3 className="lh-1 me-0 ms-0 fs-lg-2 text-primary">運動保健</h3>
                </div>
                <div className="pt-lg-6 pe-lg-8 pb-2 pb-md-24">
                <img className="cardImg rounded img-fluid d-block mx-auto" src="./images/2148247158.png"
                    style={{objectPosition: 'right'}} alt="older-running"/>
                </div>
              {/* <!-- 手機版卡片文字 --> */}
            <div className="bg-white mb-2 d-blcok d-md-none">
                <h5 className="text-primary mb-2">銀髮族在家運動簡單4招</h5>
                <p className="fs-6 text-neutral-1 up-to-2-lines px-1">
                    老化是持續且不可逆的過程，但透過運動可以提高長輩的肌耐力及平衡協調，預防身體功能衰退，減少生理上的病痛，並提升心理健康與生活品質，進而促進長壽與自主生活能力。規律的運動不僅有助於改善心血管健康，還能增強免疫力，降低罹患慢性疾病的風險。長輩可以選擇適合自己的運動，如散步、太極、游泳或瑜伽，這不僅有助於身體機能的維持，還能增加社交機會，帶來身心愉悅的生活體驗。
                </p>
            </div>
            <div className="d-flex flex-row-reverse border-bottom border-primary d-block d-md-none">
                <a href="#" className="learn-more-mobile text-primary fs-7 d-flex align-items-center mb-2">閱讀更多<svg
                    className="moreIcon" width="19" height="10" viewBox="0 0 24 24" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <path d="M22 7.45946L12 18L2 7.45946L4.33333 5L12 13.0811L19.6667 5L22 7.45946Z" fill="#E79776" />
                    </svg>
                </a>
            </div>
              {/* <!-- 電腦版卡片文字 --> */}
            <div
                className="cardText position-absolute bottom-0 bg-white rounded-20 rounded-top-left-0 d-none d-md-block vertical-rl p-5">
                <h6 className="text-primary ms-2 me-0">銀髮族在家運動簡單4招</h6>
                <p className="fs-7 text-neutral-1 up-to-6-lines pt-7 ms-2 me-0">
                    老化是持續且不可逆的過程，但透過運動可以提高長輩的肌耐力及平衡協調，預防身體功能衰退，減少生理上的病痛，並提升心理健康與生活品質，進而促進長壽與自主生活能力。規律的運動不僅有助於改善心血管健康，還能增強免疫力，降低罹患慢性疾病的風險。長輩可以選擇適合自己的運動，如散步、太極、游泳或瑜伽，這不僅有助於身體機能的維持，還能增加社交機會，帶來身心愉悅的生活體驗。
                </p>
                <a href="#" className="learn-more-H mt-auto">閱讀更多<svg className="moreIcon mt-2" width="19" height="10"
                    viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M22 7.45946L12 18L2 7.45946L4.33333 5L12 13.0811L19.6667 5L22 7.45946Z" fill="#484848" />
                    </svg>
                </a>
            </div>
            </div>
            <div className="col-lg-4 position-relative">
            <div className="cardTitle position-absolute top-0 end-0 vertical-rl bg-white p-4 rounded">
                <h3 className="lh-1 me-0 ms-0 fs-lg-2 text-primary">心靈成長</h3>
            </div>
                <div className="pt-lg-6 pe-lg-8 pb-2 pb-md-24">
                <img className="cardImg cardImgPosition rounded img-fluid d-block mx-auto" src="./images/13878.png"
                    alt="salad-with-tomatoes-cheese-bowl-wooden-table-with-green-healthy-ingredients-healthy-food-concept"/>
            </div>
              {/* <!-- 手機版卡片文字 --> */}
            <div className="bg-white mb-2 d-blcok d-md-none">
                <h5 className="text-primary mb-2">做六件事銀髮生活更快樂</h5>
                <p className="fs-6 text-neutral-1 up-to-2-lines px-1">
                    老年人是憂鬱情緒甚至憂鬱症的好發族群，這與多種因素息息相關。除了體質上的改變，身體病痛、慢性疾病的纏身讓老年人感到無力與疲憊，加上孤獨感的增加，特別是在喪偶或子女不常探訪的情況下，情緒更容易低落。此外，退休後失去工作帶來的成就感，家庭及社會支持的減少，也會加劇這種情緒波動。缺乏有效的情感交流與心理支持，讓許多長輩陷入憂鬱的惡性循環，影響身心健康。
                </p>
            </div>
            <div className="d-flex flex-row-reverse border-bottom border-primary d-block d-md-none">
                <a href="#" className="learn-more-mobile text-primary fs-7 d-flex align-items-center mb-2">閱讀更多<svg
                    className="moreIcon" width="19" height="10" viewBox="0 0 24 24" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <path d="M22 7.45946L12 18L2 7.45946L4.33333 5L12 13.0811L19.6667 5L22 7.45946Z" fill="#E79776" />
                    </svg>
                </a>
            </div>
              {/* <!-- 電腦版卡片文字 --> */}
            <div
                className="cardText position-absolute bottom-0 bg-white rounded-20 rounded-top-left-0 d-none d-md-block vertical-rl p-5">
                <h6 className="text-primary ms-2 me-0">做六件事銀髮生活更快樂</h6>
                <p className="fs-7 text-neutral-1 up-to-6-lines pt-7 ms-2 me-0">
                    老年人是憂鬱情緒甚至憂鬱症的好發族群，這與多種因素息息相關。除了體質上的改變，身體病痛、慢性疾病的纏身讓老年人感到無力與疲憊，加上孤獨感的增加，特別是在喪偶或子女不常探訪的情況下，情緒更容易低落。此外，退休後失去工作帶來的成就感，家庭及社會支持的減少，也會加劇這種情緒波動。缺乏有效的情感交流與心理支持，讓許多長輩陷入憂鬱的惡性循環，影響身心健康。
                </p>
                <a href="#" className="learn-more-H mt-auto">閱讀更多<svg className="moreIcon mt-2" width="19" height="10"
                    viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M22 7.45946L12 18L2 7.45946L4.33333 5L12 13.0811L19.6667 5L22 7.45946Z" fill="#484848" />
                    </svg>
                </a>
            </div>
            </div>
        </div>
        </div>
    </section>
      {/* <!-- 學員分享 --> */}
    <section className="studentComment">
        {/* <!-- 裝飾線及精選課程標題 --> */}
        <div className="container mb-lg-10">
            <div className="position-relative decoLine"></div>
            <h3 className="fs-lg-1 mt-2 mt-lg-4">學員分享</h3>
        </div>
        {/* <!-- 學員分享對話框 --> */}
        <div className="commentBackground mx-auto pt-6">
            <div className="container position-relative d-none d-lg-block">
                <div type="button"
                onClick={()=>openCommentModal('commentModal1')}
                className="speechBubble1 blueBox position-absolute ms-46 ms-xl-0 "
                data-bs-toggle="modal" data-bs-target="#commentModal1">
                    <p className="dialogText position-absolute fs-0 text-secondary-2">
                    社群氛圍非常好
                    </p>
                    <svg className="dialogBox" width="452" height="168" viewBox="0 0 452 168" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <path
                    d="M403.874 4.92747C404.659 4.18993 405.478 3.50119 406.59 2.56748L405.827 6.86628C403.892 17.7579 402.072 28.0074 400.185 38.6728L399.978 39.847H401.17C403.501 39.847 405.817 39.8826 408.119 39.918C413.12 39.9949 418.055 40.0708 422.935 39.7781C433.703 39.1392 440.71 40.4998 444.98 44.3616C449.228 48.2035 451.046 54.7825 450.716 65.3652C450.11 84.726 450.247 104.117 450.383 123.486C450.443 131.973 450.503 140.455 450.5 148.929C450.5 154.784 448.775 159.25 445.627 162.259C442.472 165.274 437.75 166.958 431.498 166.962C369.621 167.014 82.5107 167.014 20.6332 166.954C14.3253 166.947 9.58065 165.29 6.41534 162.304C3.25884 159.326 1.53234 154.894 1.52366 149.04C1.4788 118.793 1.48777 88.553 1.52366 58.3053C1.53237 52.1342 3.27633 47.5713 6.50961 44.5396C9.75363 41.4978 14.6527 39.8507 21.2699 39.847C31.0216 39.8413 55.4558 39.8429 87.075 39.8449C179.296 39.8509 332.636 39.8608 361.084 39.7053C364.202 39.6891 367.972 38.2099 370.234 36.1838L370.235 36.1835C378.469 28.8014 386.515 21.233 394.552 13.6738C397.657 10.7539 400.76 7.83542 403.872 4.92954L403.874 4.92747Z"
                    fill="white" stroke="#487181" strokeWidth="2" />
                    </svg>
                </div>
                <div
                onClick={()=>openCommentModal('commentModal2')} 
                type="button" className="speechBubble2 blueBox position-absolute ms-46 ms-xl-0" data-bs-toggle="modal"
                    data-bs-target="#commentModal2">
                    <p className="dialogText position-absolute fs-3 text-secondary-2">
                    以往在外面很難做到<br/>對長輩來說安全的肌力訓練，<br/>來到Move with Joy，<br/>跟一群同輩的人互動，才知道高齡樂活的樣貌
                    </p>
                    <svg className="dialogBox" width="638" height="270" viewBox="0 0 638 270" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path">
                        <path
                        d="M49.1879 -9.15527e-05C51.8815 13.493 54.3249 25.7204 56.8784 38.5548C48.5469 38.5548 40.5659 38.9101 32.655 38.4882C8.53174 37.2151 -0.270447 43.7655 0.470581 64.9045C1.44196 92.5198 -0.0100098 223.436 0 251.073C0 263.086 7.98096 269.955 22.3207 269.962C91.376 270.014 545.153 270.014 614.208 269.955C628.658 269.94 636.629 263.197 636.649 251.184C636.699 221.163 637.4 87.8864 637.36 57.8656C637.34 45.2459 629.319 38.5622 614.208 38.5548C571.579 38.5326 144.249 38.6214 101.62 38.4142C98.4158 38.3994 94.4703 37.0227 92.1471 35.1723C79.4196 25.0247 67.1025 14.5292 54.6253 4.16701C53.2434 3.01236 51.7413 1.95393 49.1678 -9.15527e-05L49.1879 -9.15527e-05Z" />
                    </clipPath>

                    <path
                        d="M49.1879 -9.15527e-05C51.8815 13.493 54.3249 25.7204 56.8784 38.5548C48.5469 38.5548 40.5659 38.9101 32.655 38.4882C8.53174 37.2151 -0.270447 43.7655 0.470581 64.9045C1.44196 92.5198 -0.0100098 223.436 0 251.073C0 263.086 7.98096 269.955 22.3207 269.962C91.376 270.014 545.153 270.014 614.208 269.955C628.658 269.94 636.629 263.197 636.649 251.184C636.699 221.163 637.4 87.8864 637.36 57.8656C637.34 45.2459 629.319 38.5622 614.208 38.5548C571.579 38.5326 144.249 38.6214 101.62 38.4142C98.4158 38.3994 94.4703 37.0227 92.1471 35.1723C79.4196 25.0247 67.1025 14.5292 54.6253 4.16701C53.2434 3.01236 51.7413 1.95393 49.1678 -9.15527e-05L49.1879 -9.15527e-05Z"
                        fill="white" stroke="#487181" strokeWidth="4" clipPath="url(#clip-path)" />
                    </svg>
                </div>
                <div
                    onClick={()=>openCommentModal('commentModal3')}
                    type="button" className="speechBubble3 blueBox position-absolute d-none d-xxl-block" data-bs-toggle="modal"
                    data-bs-target="#commentModal3">
                    <p className="dialogText vertical-rl mx-0 position-absolute fs-2  text-secondary-2 fw-bold">心情變得開朗了很多
                    </p>
                    <svg className="dialogBox" width="61" height="382" viewBox="0 0 61 382" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-2">
                        <path
                        d="M7.89438 0.574128C8.83403 5.62405 9.78026 10.6666 10.7199 15.7092C1.96527 17.2183 0.873463 18.4255 0.873463 26.3832C0.873463 56.8962 0.886696 87.4018 0.886696 117.915C0.886696 140.109 1.1777 351.303 1.1777 373.49C1.1777 379.379 4.11576 381.993 10.7198 382C24.0602 382 37.394 382 50.7344 382C57.0341 382 60.0317 379.342 60.0383 373.718C60.0515 354.409 59.734 146.102 59.734 126.793C59.734 98.2673 59.734 69.7492 59.7274 41.2238C59.7274 35.5334 59.7539 29.8431 59.7274 24.1527C59.7009 18.6243 56.7232 15.9963 50.5559 15.9963C43.0585 15.9963 35.5545 16.0551 28.0638 15.9374C26.8197 15.9153 25.3044 15.3632 24.411 14.5976C19.4547 10.3574 14.6373 5.98476 9.80673 1.63417C9.32367 1.19985 9.07226 0.552044 8.71493 -6.10352e-05C8.437 0.191335 8.16569 0.382732 7.88776 0.574128H7.89438Z" />
                    </clipPath>
                    <path
                        d="M7.89438 0.574128C8.83403 5.62405 9.78026 10.6666 10.7199 15.7092C1.96527 17.2183 0.873463 18.4255 0.873463 26.3832C0.873463 56.8962 0.886696 87.4018 0.886696 117.915C0.886696 140.109 1.1777 351.303 1.1777 373.49C1.1777 379.379 4.11576 381.993 10.7198 382C24.0602 382 37.394 382 50.7344 382C57.0341 382 60.0317 379.342 60.0383 373.718C60.0515 354.409 59.734 146.102 59.734 126.793C59.734 98.2673 59.734 69.7492 59.7274 41.2238C59.7274 35.5334 59.7539 29.8431 59.7274 24.1527C59.7009 18.6243 56.7232 15.9963 50.5559 15.9963C43.0585 15.9963 35.5545 16.0551 28.0638 15.9374C26.8197 15.9153 25.3044 15.3632 24.411 14.5976C19.4547 10.3574 14.6373 5.98476 9.80673 1.63417C9.32367 1.19985 9.07226 0.552044 8.71493 -6.10352e-05C8.437 0.191335 8.16569 0.382732 7.88776 0.574128H7.89438Z"
                        fill="white" stroke="#487181" strokeWidth="4" clipPath="url(#clip-path-2)" />
                    </svg>
                </div>
                <div 
                    onClick={()=>openCommentModal('commentModal4')}
                    type="button" className="speechBubble4 blueBox position-absolute d-none d-xl-block" data-bs-toggle="modal"
                    data-bs-target="#commentModal4">
                    <p className="dialogText position-absolute fs-0  text-secondary-2 fw-bold">教練非常專業
                    </p>
                    <svg className="dialogBox" width="399" height="168" viewBox="0 0 399 168" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M350.43 4.92747C351.216 4.18992 352.034 3.50117 353.147 2.56744C352.89 4.0127 352.636 5.44468 352.383 6.86573C350.449 17.7575 348.629 28.0072 346.742 38.6728L346.534 39.847H347.727C350.058 39.847 352.374 39.8826 354.676 39.918C359.677 39.9949 364.612 40.0708 369.492 39.7781C380.26 39.1392 387.267 40.4998 391.537 44.3616C395.784 48.2035 397.602 54.7825 397.272 65.3652C396.667 84.7261 396.803 104.117 396.94 123.486C397 131.973 397.059 140.455 397.057 148.929C397.057 154.784 395.332 159.25 392.184 162.259C389.029 165.274 384.307 166.958 378.055 166.962C316.177 167.014 82.2159 167.014 20.3384 166.954C14.0305 166.947 9.28585 165.29 6.12054 162.304C2.96404 159.326 1.23754 154.894 1.22886 149.04C1.184 118.793 1.19297 88.553 1.22886 58.3053C1.23757 52.1342 2.98153 47.5713 6.21481 44.5396C9.45883 41.4978 14.3579 39.8507 20.9751 39.847C30.7885 39.8413 51.962 39.8429 78.6579 39.845C155.862 39.8509 279.255 39.8605 307.641 39.7053C310.758 39.6891 314.529 38.2099 316.791 36.1838L316.791 36.1835C325.025 28.8014 333.072 21.233 341.109 13.6738C344.214 10.7539 347.317 7.83542 350.428 4.92954L350.43 4.92747Z"
                        fill="white" stroke="#487181" strokeWidth="2" />
                    </svg>
                </div>
                <div
                    onClick={()=>openCommentModal('commentModal5')} 
                    type="button" className="speechBubble5 blueBox position-absolute" data-bs-toggle="modal"
                    data-bs-target="#commentModal5">
                    <p className="dialogText position-absolute fs-1  text-secondary-2 fw-bold">認識了很多新朋友，<br/>生活變得更加充實有趣。
                    </p>
                    <svg className="dialogBox" width="482" height="201" viewBox="0 0 482 201" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-3">
                        <path
                        d="M83.9718 165.898C86.5599 177.588 89.0817 189 91.6034 200.395L89.5573 201C89.4467 200.874 89.3139 200.756 89.1812 200.647C74.5594 189.479 59.9155 178.327 45.172 167.251C44.0217 166.386 41.7543 165.621 40.1395 165.57C34.3107 165.411 28.4708 165.528 22.6309 165.503C10.5972 165.47 0.908342 158.041 0.974704 148.906C1.06319 137.158 1.10743 125.401 1.12955 113.653C1.15167 96.039 1.12955 45.6511 1.12955 28.0371C1.12955 24.0202 1.10743 20.0117 1.12955 15.9948C1.17379 6.60797 9.75664 0.027951 22.0779 0.0111438C42.617 -0.014067 63.1561 0.0111438 83.6953 0.0111438C160.443 0.0111438 383.188 0.0111438 459.925 0.0111438C470.477 0.0111438 478.418 4.5827 480.719 11.8014C481.15 13.1544 481.294 14.5494 481.294 15.936C481.305 49.4747 481.305 115.779 481.316 149.318C481.316 158.881 472.589 165.503 459.903 165.512C384.847 165.512 163.795 165.512 88.7388 165.512H84.381C84.1156 165.512 83.9165 165.688 83.9607 165.89L83.9718 165.898Z" />
                    </clipPath>
                    <path
                        d="M83.9718 165.898C86.5599 177.588 89.0817 189 91.6034 200.395L89.5573 201C89.4467 200.874 89.3139 200.756 89.1812 200.647C74.5594 189.479 59.9155 178.327 45.172 167.251C44.0217 166.386 41.7543 165.621 40.1395 165.57C34.3107 165.411 28.4708 165.528 22.6309 165.503C10.5972 165.47 0.908342 158.041 0.974704 148.906C1.06319 137.158 1.10743 125.401 1.12955 113.653C1.15167 96.039 1.12955 45.6511 1.12955 28.0371C1.12955 24.0202 1.10743 20.0117 1.12955 15.9948C1.17379 6.60797 9.75664 0.027951 22.0779 0.0111438C42.617 -0.014067 63.1561 0.0111438 83.6953 0.0111438C160.443 0.0111438 383.188 0.0111438 459.925 0.0111438C470.477 0.0111438 478.418 4.5827 480.719 11.8014C481.15 13.1544 481.294 14.5494 481.294 15.936C481.305 49.4747 481.305 115.779 481.316 149.318C481.316 158.881 472.589 165.503 459.903 165.512C384.847 165.512 163.795 165.512 88.7388 165.512H84.381C84.1156 165.512 83.9165 165.688 83.9607 165.89L83.9718 165.898Z"
                        fill="white" stroke="#487181" strokeWidth="4" clipPath="url(#clip-path-3)" />
                    </svg>
                </div>
                <div 
                    onClick={()=>openCommentModal('commentModal6')}
                    type="button" className="speechBubble6 blueBox position-absolute" data-bs-toggle="modal"
                    data-bs-target="#commentModal6">
                    <p className="dialogText vertical-rl mx-0 position-absolute fs-1  text-secondary-2 fw-bold">網站的課程安排非常靈活
                    </p>
                    <svg className="dialogBox" width="76" height="570" viewBox="0 0 76 570" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-4">
                        <path
                        d="M67.0297 0.724057C65.8292 7.09232 64.6203 13.4513 63.4197 19.8103C74.605 21.7133 75.9999 23.2358 75.9999 33.2709C75.9999 71.7497 75.983 110.219 75.983 148.698C75.983 176.687 75.6112 531.289 75.6112 559.269C75.6112 566.695 71.8575 569.991 63.4199 570C46.3757 570 29.3399 570 12.2957 570C4.24704 570 0.417169 566.649 0.408714 559.556C0.391805 535.207 0.797465 184.243 0.797465 159.893C0.797465 123.921 0.797466 87.9581 0.805921 51.9858C0.805921 44.8099 0.772103 37.634 0.805921 30.4581C0.839739 23.4864 4.64425 20.1723 12.5238 20.1723C22.1027 20.1723 31.6901 20.2466 41.2606 20.0981C42.85 20.0702 44.7861 19.374 45.9274 18.4085C52.2598 13.0614 58.4147 7.54719 64.5865 2.06084C65.2036 1.51313 65.5248 0.696208 65.9814 -3.05176e-05C66.3365 0.241332 66.6831 0.482695 67.0382 0.724057H67.0297Z" />
                    </clipPath>
                    <path
                        d="M67.0297 0.724057C65.8292 7.09232 64.6203 13.4513 63.4197 19.8103C74.605 21.7133 75.9999 23.2358 75.9999 33.2709C75.9999 71.7497 75.983 110.219 75.983 148.698C75.983 176.687 75.6112 531.289 75.6112 559.269C75.6112 566.695 71.8575 569.991 63.4199 570C46.3757 570 29.3399 570 12.2957 570C4.24704 570 0.417169 566.649 0.408714 559.556C0.391805 535.207 0.797465 184.243 0.797465 159.893C0.797465 123.921 0.797466 87.9581 0.805921 51.9858C0.805921 44.8099 0.772103 37.634 0.805921 30.4581C0.839739 23.4864 4.64425 20.1723 12.5238 20.1723C22.1027 20.1723 31.6901 20.2466 41.2606 20.0981C42.85 20.0702 44.7861 19.374 45.9274 18.4085C52.2598 13.0614 58.4147 7.54719 64.5865 2.06084C65.2036 1.51313 65.5248 0.696208 65.9814 -3.05176e-05C66.3365 0.241332 66.6831 0.482695 67.0382 0.724057H67.0297Z"
                        fill="white" stroke="#487181" strokeWidth="4" clipPath="url(#clip-path-4)" />
                    </svg>
                </div>
                <div 
                    onClick={()=>openCommentModal('commentModal7')}
                    type="button" className="speechBubble7 orangeBox position-absolute" data-bs-toggle="modal"
                    data-bs-target="#commentModal7">
                    <p className="dialogText vertical-rl mx-0 position-absolute fs-1  text-primary fw-bold">感謝這個平台
                    </p>
                    <svg className="dialogBox" width="76" height="327" viewBox="0 0 76 327" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-5">
                        <path
                        d="M66.4306 0.724134C65.2301 7.09239 64.0211 13.4514 62.8206 19.8103C74.0058 21.7134 75.4008 23.2358 75.4008 33.271C75.4008 71.7497 75.3839 110.219 75.3839 148.698C75.3839 176.687 75.4008 288.289 75.4008 316.269C75.4008 323.695 71.6471 326.991 63.2095 327C46.1653 327 29.1295 327 12.0853 327C4.03664 327 0.206766 323.649 0.198311 316.556C0.181403 292.207 0.19831 184.243 0.19831 159.894C0.19831 123.921 0.19831 87.9582 0.206764 51.9858C0.206764 44.8099 0.172946 37.6341 0.206764 30.4582C0.240582 23.4865 4.04509 20.1724 11.9247 20.1724C21.5036 20.1724 31.0909 20.2467 40.6614 20.0981C42.2508 20.0703 44.1869 19.374 45.3283 18.4086C51.6607 13.0615 57.8155 7.54727 63.9873 2.06091C64.6045 1.5132 64.9257 0.696284 65.3823 4.57764e-05C65.7374 0.241408 66.084 0.482771 66.4391 0.724134H66.4306Z" />
                    </clipPath>
                    <path
                        d="M66.4306 0.724134C65.2301 7.09239 64.0211 13.4514 62.8206 19.8103C74.0058 21.7134 75.4008 23.2358 75.4008 33.271C75.4008 71.7497 75.3839 110.219 75.3839 148.698C75.3839 176.687 75.4008 288.289 75.4008 316.269C75.4008 323.695 71.6471 326.991 63.2095 327C46.1653 327 29.1295 327 12.0853 327C4.03664 327 0.206766 323.649 0.198311 316.556C0.181403 292.207 0.19831 184.243 0.19831 159.894C0.19831 123.921 0.19831 87.9582 0.206764 51.9858C0.206764 44.8099 0.172946 37.6341 0.206764 30.4582C0.240582 23.4865 4.04509 20.1724 11.9247 20.1724C21.5036 20.1724 31.0909 20.2467 40.6614 20.0981C42.2508 20.0703 44.1869 19.374 45.3283 18.4086C51.6607 13.0615 57.8155 7.54727 63.9873 2.06091C64.6045 1.5132 64.9257 0.696284 65.3823 4.57764e-05C65.7374 0.241408 66.084 0.482771 66.4391 0.724134H66.4306Z"
                        fill="white" stroke="#E79776" strokeWidth="4" clipPath="url(#clip-path-5)" />
                    </svg>
                </div>
                <div 
                    onClick={()=>openCommentModal('commentModal8')}
                    type="button" className="speechBubble8 orangeBox position-absolute" data-bs-toggle="modal"
                    data-bs-target="#commentModal8">
                    <p className="dialogText position-absolute fs-1  text-primary fw-bold">教練們都非常專業和熱情，<br/>讓我在這裡感覺很受歡迎。
                    </p>
                    <svg className="dialogBox" width="521" height="218" viewBox="0 0 521 218" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-6">
                        <path
                        d="M90.4469 179.929C93.2511 192.607 95.9835 204.985 98.7158 217.344L96.4988 218C96.3789 217.863 96.2351 217.736 96.0913 217.617C80.2485 205.504 64.3817 193.41 48.407 181.397C47.1606 180.458 44.7039 179.629 42.9543 179.574C36.6387 179.401 30.3111 179.528 23.9836 179.501C10.945 179.465 0.447018 171.407 0.518922 161.5C0.614794 148.758 0.66273 136.007 0.686698 123.265C0.710666 104.162 0.686698 49.5122 0.686698 30.4085C0.686698 26.0518 0.66273 21.7043 0.686698 17.3476C0.734634 7.16692 10.0342 0.0303812 23.3844 0.0121525C45.6387 -0.0151906 67.893 0.0121525 90.1473 0.0121525C173.304 0.0121525 414.65 0.0121525 497.795 0.0121525C509.228 0.0121525 517.832 4.97036 520.325 12.7996C520.792 14.267 520.948 15.78 520.948 17.2838C520.96 53.6592 520.96 125.571 520.972 161.947C520.972 172.319 511.517 179.501 497.771 179.51C416.448 179.51 176.935 179.51 95.612 179.51H90.8903C90.6027 179.51 90.3869 179.702 90.4349 179.92L90.4469 179.929Z" />
                    </clipPath>
                    <path
                        d="M90.4469 179.929C93.2511 192.607 95.9835 204.985 98.7158 217.344L96.4988 218C96.3789 217.863 96.2351 217.736 96.0913 217.617C80.2485 205.504 64.3817 193.41 48.407 181.397C47.1606 180.458 44.7039 179.629 42.9543 179.574C36.6387 179.401 30.3111 179.528 23.9836 179.501C10.945 179.465 0.447018 171.407 0.518922 161.5C0.614794 148.758 0.66273 136.007 0.686698 123.265C0.710666 104.162 0.686698 49.5122 0.686698 30.4085C0.686698 26.0518 0.66273 21.7043 0.686698 17.3476C0.734634 7.16692 10.0342 0.0303812 23.3844 0.0121525C45.6387 -0.0151906 67.893 0.0121525 90.1473 0.0121525C173.304 0.0121525 414.65 0.0121525 497.795 0.0121525C509.228 0.0121525 517.832 4.97036 520.325 12.7996C520.792 14.267 520.948 15.78 520.948 17.2838C520.96 53.6592 520.96 125.571 520.972 161.947C520.972 172.319 511.517 179.501 497.771 179.51C416.448 179.51 176.935 179.51 95.612 179.51H90.8903C90.6027 179.51 90.3869 179.702 90.4349 179.92L90.4469 179.929Z"
                        fill="white" stroke="#E79776" strokeWidth="4" clipPath="url(#clip-path-6)" />
                    </svg>
                </div>
                <div 
                    onClick={()=>openCommentModal('commentModal9')}
                    type="button" className="speechBubble9 orangeBox position-absolute d-none d-xxl-block"
                    data-bs-toggle="modal" data-bs-target="#commentModal9">
                    <p className="dialogText position-absolute fs-0 text-primary fw-bold">重新找回了年輕時的活力
                    </p>
                    <svg className="dialogBox" width="661" height="168" viewBox="0 0 661 168" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-7">
                        <path
                        d="M616.399 0C613.986 13.5953 611.796 25.9154 609.508 38.847C616.974 38.847 624.125 39.205 631.214 38.7799C652.83 37.4972 660.717 44.0972 660.053 65.3963C659.183 93.2209 659.847 121.083 659.838 148.93C659.838 161.034 652.686 167.954 639.837 167.962C577.959 168.014 82.0171 167.902 20.139 167.842C7.19087 167.827 0.048323 161.034 0.0303769 148.93C-0.0144883 118.681 -0.00551525 88.4405 0.0303769 58.1922C0.048323 45.4769 7.23573 38.7426 20.7761 38.7351C58.9743 38.7128 531.218 38.9141 569.417 38.7053C572.288 38.6904 575.823 37.3033 577.905 35.4389C589.31 25.2144 600.347 14.6394 611.527 4.19867C612.765 3.03527 614.111 1.96883 616.417 0L616.399 0Z" />
                    </clipPath>
                    <path
                        d="M616.399 0C613.986 13.5953 611.796 25.9154 609.508 38.847C616.974 38.847 624.125 39.205 631.214 38.7799C652.83 37.4972 660.717 44.0972 660.053 65.3963C659.183 93.2209 659.847 121.083 659.838 148.93C659.838 161.034 652.686 167.954 639.837 167.962C577.959 168.014 82.0171 167.902 20.139 167.842C7.19087 167.827 0.048323 161.034 0.0303769 148.93C-0.0144883 118.681 -0.00551525 88.4405 0.0303769 58.1922C0.048323 45.4769 7.23573 38.7426 20.7761 38.7351C58.9743 38.7128 531.218 38.9141 569.417 38.7053C572.288 38.6904 575.823 37.3033 577.905 35.4389C589.31 25.2144 600.347 14.6394 611.527 4.19867C612.765 3.03527 614.111 1.96883 616.417 0L616.399 0Z"
                        fill="white" stroke="#E79776" strokeWidth="4" clipPath="url(#clip-path-7)" />
                    </svg>
                </div>
                <div 
                onClick={()=>openCommentModal('commentModal10')}
                type="button" className="speechBubble10 orangeBox position-absolute d-none d-xl-block"
                    data-bs-toggle="modal" data-bs-target="#commentModal10">
                    <p className="dialogText position-absolute fs-2 text-primary">教練們非常有耐心，<br/>給了我很多有用的建議，<br/>讓我的運動效果顯著提升。
                    </p>
                    <svg className="dialogBox" width="481" height="264" viewBox="0 0 481 264" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-8">
                        <path
                        d="M384.049 263.616C386.844 246.557 389.665 229.472 392.615 211.465C374.713 211.465 44.6927 211.901 27.5865 211.209C21.7903 210.978 15.5325 208.878 10.5571 205.856C3.65816 201.68 0.990915 194.329 0.990915 186.209C0.990915 132.522 0.913975 78.8344 1.06785 25.1468C1.11915 10.7516 11.0957 0.377811 25.586 0.249739C64.6202 -0.0832464 416.517 -0.0832464 455.552 0.249739C470.35 0.377811 480.198 10.9565 480.224 25.8384C480.326 79.2698 480.352 132.701 480.224 186.158C480.198 200.938 469.914 212.182 455.244 211.106C442.01 210.133 433.316 215.102 424.853 224.323C412.311 238.053 398.693 250.834 385.536 264C385.023 263.872 384.536 263.744 384.023 263.616H384.049Z" />
                    </clipPath>
                    <path
                        d="M384.049 263.616C386.844 246.557 389.665 229.472 392.615 211.465C374.713 211.465 44.6927 211.901 27.5865 211.209C21.7903 210.978 15.5325 208.878 10.5571 205.856C3.65816 201.68 0.990915 194.329 0.990915 186.209C0.990915 132.522 0.913975 78.8344 1.06785 25.1468C1.11915 10.7516 11.0957 0.377811 25.586 0.249739C64.6202 -0.0832464 416.517 -0.0832464 455.552 0.249739C470.35 0.377811 480.198 10.9565 480.224 25.8384C480.326 79.2698 480.352 132.701 480.224 186.158C480.198 200.938 469.914 212.182 455.244 211.106C442.01 210.133 433.316 215.102 424.853 224.323C412.311 238.053 398.693 250.834 385.536 264C385.023 263.872 384.536 263.744 384.023 263.616H384.049Z"
                        fill="white" stroke="#E79776" strokeWidth="4" clipPath="url(#clip-path-8)" />
                    </svg>
                </div>
                <div 
                    onClick={()=>openCommentModal('commentModal11')}
                    type="button" className="speechBubble11 orangeBox position-absolute d-none d-xl-block"
                    data-bs-toggle="modal" data-bs-target="#commentModal11">
                    <p className="dialogText position-absolute fs-2 text-primary">每次參加完活動，<br/>我都覺得自己充滿了<br/>活力和正能量！很開心！
                    </p>
                    <svg className="dialogBox" width="432" height="220" viewBox="0 0 432 220" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-9">
                        <path
                        d="M32.582 58.3423C21.7736 60.1634 11.2139 61.9392 0.676865 63.7151L0.111572 62.2785C0.224631 62.1994 0.337689 62.1089 0.439442 62.0071C10.773 51.7253 21.0839 41.4323 31.3157 31.0714C32.1185 30.257 32.8307 28.6734 32.8646 27.531C33.0116 23.4364 32.9099 19.3305 32.9212 15.2246C32.9664 6.76395 39.8404 -0.0452947 48.2858 -5.04898e-05C59.1508 0.0678158 70.0157 0.0904379 80.8806 0.101749C97.1724 0.124371 389.101 0.101749 405.393 0.101749C409.101 0.101749 412.809 0.0904379 416.529 0.101749C425.212 0.124371 431.294 6.16447 431.306 14.8287C431.328 29.2616 431.306 43.7058 431.306 58.1387C431.306 112.081 431.306 151.025 431.306 204.967C431.306 212.387 427.077 217.964 420.396 219.581C419.141 219.887 417.852 219.988 416.574 219.988C385.562 219.988 78.9021 219.988 47.8901 220C39.049 220 32.9212 213.869 32.9212 204.945C32.9212 152.19 32.9212 114.434 32.9212 61.6791V58.6138C32.9212 58.4328 32.7516 58.2858 32.5707 58.3197L32.582 58.3423Z" />
                    </clipPath>
                    <path
                        d="M32.582 58.3423C21.7736 60.1634 11.2139 61.9392 0.676865 63.7151L0.111572 62.2785C0.224631 62.1994 0.337689 62.1089 0.439442 62.0071C10.773 51.7253 21.0839 41.4323 31.3157 31.0714C32.1185 30.257 32.8307 28.6734 32.8646 27.531C33.0116 23.4364 32.9099 19.3305 32.9212 15.2246C32.9664 6.76395 39.8404 -0.0452947 48.2858 -5.04898e-05C59.1508 0.0678158 70.0157 0.0904379 80.8806 0.101749C97.1724 0.124371 389.101 0.101749 405.393 0.101749C409.101 0.101749 412.809 0.0904379 416.529 0.101749C425.212 0.124371 431.294 6.16447 431.306 14.8287C431.328 29.2616 431.306 43.7058 431.306 58.1387C431.306 112.081 431.306 151.025 431.306 204.967C431.306 212.387 427.077 217.964 420.396 219.581C419.141 219.887 417.852 219.988 416.574 219.988C385.562 219.988 78.9021 219.988 47.8901 220C39.049 220 32.9212 213.869 32.9212 204.945C32.9212 152.19 32.9212 114.434 32.9212 61.6791V58.6138C32.9212 58.4328 32.7516 58.2858 32.5707 58.3197L32.582 58.3423Z"
                        fill="white" stroke="#E79776" strokeWidth="4" clipPath="url(#clip-path-9)" />
                    </svg>
                </div>
            </div>

            <div className="container d-block d-lg-none mt-6">
                <div 
                    onClick={()=>openCommentModal('commentModal7')}
                    type="button" className="speechBubbleSm orangeBox position-relative mb-2" data-bs-toggle="modal"
                    data-bs-target="#commentModal7">
                    <p className="dialogText position-absolute fs-5  text-primary">感謝這個平台，…
                    </p>
                    <svg className="dialogBox" width="220" height="70" viewBox="0 0 220 70" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-10">
                        <path
                        d="M38.0134 54.1371C39.1988 59.4196 40.3538 64.5769 41.5088 69.7266L40.5716 70C40.521 69.943 40.4602 69.8899 40.3994 69.8405C33.7025 64.7934 26.9955 59.7538 20.2428 54.7485C19.716 54.3573 18.6775 54.0117 17.9379 53.9889C15.2683 53.9168 12.5936 53.9699 9.91887 53.9586C4.40735 53.9434 -0.0302392 50.5862 0.000155207 46.4581C0.0406811 41.149 0.060944 35.836 0.0710755 30.5268C0.081207 22.5669 0.0710755 20.6303 0.0710755 12.6704C0.0710755 10.8551 0.060944 9.04357 0.0710755 7.22827C0.0913385 2.98625 4.02235 0.012659 9.66558 0.00506359C19.0727 -0.00632948 28.4797 0.00506359 37.8868 0.00506359C73.0379 0.00506359 175.057 0.00506359 210.203 0.00506359C215.036 0.00506359 218.673 2.07101 219.726 5.33322C219.924 5.94465 219.99 6.57507 219.99 7.20169C219.995 22.3583 219.995 31.4876 220 46.6442C220 50.966 216.003 53.9586 210.193 53.9624C175.817 53.9624 74.5729 53.9624 40.1968 53.9624H38.2009C38.0793 53.9624 37.9881 54.0421 38.0084 54.1333L38.0134 54.1371Z" />
                    </clipPath>
                    <path
                        d="M38.0134 54.1371C39.1988 59.4196 40.3538 64.5769 41.5088 69.7266L40.5716 70C40.521 69.943 40.4602 69.8899 40.3994 69.8405C33.7025 64.7934 26.9955 59.7538 20.2428 54.7485C19.716 54.3573 18.6775 54.0117 17.9379 53.9889C15.2683 53.9168 12.5936 53.9699 9.91887 53.9586C4.40735 53.9434 -0.0302392 50.5862 0.000155207 46.4581C0.0406811 41.149 0.060944 35.836 0.0710755 30.5268C0.081207 22.5669 0.0710755 20.6303 0.0710755 12.6704C0.0710755 10.8551 0.060944 9.04357 0.0710755 7.22827C0.0913385 2.98625 4.02235 0.012659 9.66558 0.00506359C19.0727 -0.00632948 28.4797 0.00506359 37.8868 0.00506359C73.0379 0.00506359 175.057 0.00506359 210.203 0.00506359C215.036 0.00506359 218.673 2.07101 219.726 5.33322C219.924 5.94465 219.99 6.57507 219.99 7.20169C219.995 22.3583 219.995 31.4876 220 46.6442C220 50.966 216.003 53.9586 210.193 53.9624C175.817 53.9624 74.5729 53.9624 40.1968 53.9624H38.2009C38.0793 53.9624 37.9881 54.0421 38.0084 54.1333L38.0134 54.1371Z"
                        fill="white" stroke="#E79776" strokeWidth="4" clipPath="url(#clip-path-10)" />
                    </svg>
                </div>
                <div 
                onClick={()=>openCommentModal('commentModal5')}
                type="button" className="speechBubbleSm blueBox position-relative mb-2 ms-auto" data-bs-toggle="modal"
                    data-bs-target="#commentModal5">
                    <p className="dialogText position-absolute fs-5  text-secondary-2">認識了很多新朋友…
                    </p>
                    <svg className="dialogBox" width="220" height="70" viewBox="0 0 220 70" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-11">
                        <path
                        d="M181.987 54.1342C180.801 59.4166 179.646 64.5736 178.491 69.723L179.428 69.9964C179.479 69.9394 179.54 69.8862 179.601 69.8369C186.298 64.79 193.005 59.7507 199.757 54.7456C200.284 54.3545 201.322 54.0089 202.062 53.9861C204.732 53.914 207.406 53.9671 210.081 53.9557C215.593 53.9406 220.03 50.5836 220 46.4557C219.959 41.1468 219.939 35.8341 219.929 30.5252C219.919 22.5657 219.929 20.6292 219.929 12.6697C219.929 10.8545 219.939 9.0431 219.929 7.2279C219.909 2.9861 215.978 0.0126583 210.334 0.00506332C200.927 -0.00632916 191.52 0.00506332 182.113 0.00506332C146.962 0.00506332 44.9432 0.00506332 9.79712 0.00506332C4.9644 0.00506332 1.32721 2.0709 0.273529 5.33295C0.0759735 5.94434 0.0101166 6.57473 0.0101166 7.20131C0.00505066 22.3571 0.00506592 31.486 0 46.6418C0 50.9633 3.99687 53.9558 9.80727 53.9596C44.1833 53.9596 145.427 53.9596 179.803 53.9596H181.799C181.921 53.9596 182.012 54.0393 181.992 54.1304L181.987 54.1342Z" />
                    </clipPath>
                    <path
                        d="M181.987 54.1342C180.801 59.4166 179.646 64.5736 178.491 69.723L179.428 69.9964C179.479 69.9394 179.54 69.8862 179.601 69.8369C186.298 64.79 193.005 59.7507 199.757 54.7456C200.284 54.3545 201.322 54.0089 202.062 53.9861C204.732 53.914 207.406 53.9671 210.081 53.9557C215.593 53.9406 220.03 50.5836 220 46.4557C219.959 41.1468 219.939 35.8341 219.929 30.5252C219.919 22.5657 219.929 20.6292 219.929 12.6697C219.929 10.8545 219.939 9.0431 219.929 7.2279C219.909 2.9861 215.978 0.0126583 210.334 0.00506332C200.927 -0.00632916 191.52 0.00506332 182.113 0.00506332C146.962 0.00506332 44.9432 0.00506332 9.79712 0.00506332C4.9644 0.00506332 1.32721 2.0709 0.273529 5.33295C0.0759735 5.94434 0.0101166 6.57473 0.0101166 7.20131C0.00505066 22.3571 0.00506592 31.486 0 46.6418C0 50.9633 3.99687 53.9558 9.80727 53.9596C44.1833 53.9596 145.427 53.9596 179.803 53.9596H181.799C181.921 53.9596 182.012 54.0393 181.992 54.1304L181.987 54.1342Z"
                        fill="white" stroke="#487181" strokeWidth="4" clipPath="url(#clip-path-11)" />
                    </svg>

                </div>
                <div 
                onClick={()=>openCommentModal('commentModal8')}
                type="button" className="speechBubbleSm orangeBox position-relative mb-2" data-bs-toggle="modal"
                    data-bs-target="#commentModal8">
                    <p className="dialogText position-absolute fs-5  text-primary">教練們都非常專業…
                    </p>
                    <svg className="dialogBox" width="220" height="70" viewBox="0 0 220 70" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-10">
                        <path
                        d="M38.0134 54.1371C39.1988 59.4196 40.3538 64.5769 41.5088 69.7266L40.5716 70C40.521 69.943 40.4602 69.8899 40.3994 69.8405C33.7025 64.7934 26.9955 59.7538 20.2428 54.7485C19.716 54.3573 18.6775 54.0117 17.9379 53.9889C15.2683 53.9168 12.5936 53.9699 9.91887 53.9586C4.40735 53.9434 -0.0302392 50.5862 0.000155207 46.4581C0.0406811 41.149 0.060944 35.836 0.0710755 30.5268C0.081207 22.5669 0.0710755 20.6303 0.0710755 12.6704C0.0710755 10.8551 0.060944 9.04357 0.0710755 7.22827C0.0913385 2.98625 4.02235 0.012659 9.66558 0.00506359C19.0727 -0.00632948 28.4797 0.00506359 37.8868 0.00506359C73.0379 0.00506359 175.057 0.00506359 210.203 0.00506359C215.036 0.00506359 218.673 2.07101 219.726 5.33322C219.924 5.94465 219.99 6.57507 219.99 7.20169C219.995 22.3583 219.995 31.4876 220 46.6442C220 50.966 216.003 53.9586 210.193 53.9624C175.817 53.9624 74.5729 53.9624 40.1968 53.9624H38.2009C38.0793 53.9624 37.9881 54.0421 38.0084 54.1333L38.0134 54.1371Z" />
                    </clipPath>
                    <path
                        d="M38.0134 54.1371C39.1988 59.4196 40.3538 64.5769 41.5088 69.7266L40.5716 70C40.521 69.943 40.4602 69.8899 40.3994 69.8405C33.7025 64.7934 26.9955 59.7538 20.2428 54.7485C19.716 54.3573 18.6775 54.0117 17.9379 53.9889C15.2683 53.9168 12.5936 53.9699 9.91887 53.9586C4.40735 53.9434 -0.0302392 50.5862 0.000155207 46.4581C0.0406811 41.149 0.060944 35.836 0.0710755 30.5268C0.081207 22.5669 0.0710755 20.6303 0.0710755 12.6704C0.0710755 10.8551 0.060944 9.04357 0.0710755 7.22827C0.0913385 2.98625 4.02235 0.012659 9.66558 0.00506359C19.0727 -0.00632948 28.4797 0.00506359 37.8868 0.00506359C73.0379 0.00506359 175.057 0.00506359 210.203 0.00506359C215.036 0.00506359 218.673 2.07101 219.726 5.33322C219.924 5.94465 219.99 6.57507 219.99 7.20169C219.995 22.3583 219.995 31.4876 220 46.6442C220 50.966 216.003 53.9586 210.193 53.9624C175.817 53.9624 74.5729 53.9624 40.1968 53.9624H38.2009C38.0793 53.9624 37.9881 54.0421 38.0084 54.1333L38.0134 54.1371Z"
                        fill="white" stroke="#E79776" strokeWidth="4" clipPath="url(#clip-path-10)" />
                    </svg>
                </div>
                <div 
                    onClick={()=>openCommentModal('commentModal13')}
                    type="button" className="speechBubbleSm blueBox position-relative mb-2 ms-auto" data-bs-toggle="modal"
                    data-bs-target="#commentModal3">
                    <p className="dialogText position-absolute fs-5  text-secondary-2">心情變得開朗了…
                    </p>
                    <svg className="dialogBox" width="220" height="70" viewBox="0 0 220 70" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-11">
                        <path
                        d="M181.987 54.1342C180.801 59.4166 179.646 64.5736 178.491 69.723L179.428 69.9964C179.479 69.9394 179.54 69.8862 179.601 69.8369C186.298 64.79 193.005 59.7507 199.757 54.7456C200.284 54.3545 201.322 54.0089 202.062 53.9861C204.732 53.914 207.406 53.9671 210.081 53.9557C215.593 53.9406 220.03 50.5836 220 46.4557C219.959 41.1468 219.939 35.8341 219.929 30.5252C219.919 22.5657 219.929 20.6292 219.929 12.6697C219.929 10.8545 219.939 9.0431 219.929 7.2279C219.909 2.9861 215.978 0.0126583 210.334 0.00506332C200.927 -0.00632916 191.52 0.00506332 182.113 0.00506332C146.962 0.00506332 44.9432 0.00506332 9.79712 0.00506332C4.9644 0.00506332 1.32721 2.0709 0.273529 5.33295C0.0759735 5.94434 0.0101166 6.57473 0.0101166 7.20131C0.00505066 22.3571 0.00506592 31.486 0 46.6418C0 50.9633 3.99687 53.9558 9.80727 53.9596C44.1833 53.9596 145.427 53.9596 179.803 53.9596H181.799C181.921 53.9596 182.012 54.0393 181.992 54.1304L181.987 54.1342Z" />
                    </clipPath>
                    <path
                        d="M181.987 54.1342C180.801 59.4166 179.646 64.5736 178.491 69.723L179.428 69.9964C179.479 69.9394 179.54 69.8862 179.601 69.8369C186.298 64.79 193.005 59.7507 199.757 54.7456C200.284 54.3545 201.322 54.0089 202.062 53.9861C204.732 53.914 207.406 53.9671 210.081 53.9557C215.593 53.9406 220.03 50.5836 220 46.4557C219.959 41.1468 219.939 35.8341 219.929 30.5252C219.919 22.5657 219.929 20.6292 219.929 12.6697C219.929 10.8545 219.939 9.0431 219.929 7.2279C219.909 2.9861 215.978 0.0126583 210.334 0.00506332C200.927 -0.00632916 191.52 0.00506332 182.113 0.00506332C146.962 0.00506332 44.9432 0.00506332 9.79712 0.00506332C4.9644 0.00506332 1.32721 2.0709 0.273529 5.33295C0.0759735 5.94434 0.0101166 6.57473 0.0101166 7.20131C0.00505066 22.3571 0.00506592 31.486 0 46.6418C0 50.9633 3.99687 53.9558 9.80727 53.9596C44.1833 53.9596 145.427 53.9596 179.803 53.9596H181.799C181.921 53.9596 182.012 54.0393 181.992 54.1304L181.987 54.1342Z"
                        fill="white" stroke="#487181" strokeWidth="4" clipPath="url(#clip-path-11)" />
                    </svg>

                </div>
                <div 
                    onClick={()=>openCommentModal('commentModal9')}
                    type="button" className="speechBubbleSm orangeBox position-relative mb-2" data-bs-toggle="modal"
                    data-bs-target="#commentModal9">
                    <p className="dialogText position-absolute fs-5  text-primary">重新找回了年輕時…
                    </p>
                    <svg className="dialogBox" width="220" height="70" viewBox="0 0 220 70" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-10">
                        <path
                        d="M38.0134 54.1371C39.1988 59.4196 40.3538 64.5769 41.5088 69.7266L40.5716 70C40.521 69.943 40.4602 69.8899 40.3994 69.8405C33.7025 64.7934 26.9955 59.7538 20.2428 54.7485C19.716 54.3573 18.6775 54.0117 17.9379 53.9889C15.2683 53.9168 12.5936 53.9699 9.91887 53.9586C4.40735 53.9434 -0.0302392 50.5862 0.000155207 46.4581C0.0406811 41.149 0.060944 35.836 0.0710755 30.5268C0.081207 22.5669 0.0710755 20.6303 0.0710755 12.6704C0.0710755 10.8551 0.060944 9.04357 0.0710755 7.22827C0.0913385 2.98625 4.02235 0.012659 9.66558 0.00506359C19.0727 -0.00632948 28.4797 0.00506359 37.8868 0.00506359C73.0379 0.00506359 175.057 0.00506359 210.203 0.00506359C215.036 0.00506359 218.673 2.07101 219.726 5.33322C219.924 5.94465 219.99 6.57507 219.99 7.20169C219.995 22.3583 219.995 31.4876 220 46.6442C220 50.966 216.003 53.9586 210.193 53.9624C175.817 53.9624 74.5729 53.9624 40.1968 53.9624H38.2009C38.0793 53.9624 37.9881 54.0421 38.0084 54.1333L38.0134 54.1371Z" />
                    </clipPath>
                    <path
                        d="M38.0134 54.1371C39.1988 59.4196 40.3538 64.5769 41.5088 69.7266L40.5716 70C40.521 69.943 40.4602 69.8899 40.3994 69.8405C33.7025 64.7934 26.9955 59.7538 20.2428 54.7485C19.716 54.3573 18.6775 54.0117 17.9379 53.9889C15.2683 53.9168 12.5936 53.9699 9.91887 53.9586C4.40735 53.9434 -0.0302392 50.5862 0.000155207 46.4581C0.0406811 41.149 0.060944 35.836 0.0710755 30.5268C0.081207 22.5669 0.0710755 20.6303 0.0710755 12.6704C0.0710755 10.8551 0.060944 9.04357 0.0710755 7.22827C0.0913385 2.98625 4.02235 0.012659 9.66558 0.00506359C19.0727 -0.00632948 28.4797 0.00506359 37.8868 0.00506359C73.0379 0.00506359 175.057 0.00506359 210.203 0.00506359C215.036 0.00506359 218.673 2.07101 219.726 5.33322C219.924 5.94465 219.99 6.57507 219.99 7.20169C219.995 22.3583 219.995 31.4876 220 46.6442C220 50.966 216.003 53.9586 210.193 53.9624C175.817 53.9624 74.5729 53.9624 40.1968 53.9624H38.2009C38.0793 53.9624 37.9881 54.0421 38.0084 54.1333L38.0134 54.1371Z"
                        fill="white" stroke="#E79776" strokeWidth="4" clipPath="url(#clip-path-10)" />
                    </svg>
                </div>
                <div 
                    onClick={()=>openCommentModal('commentModal1')}
                    type="button" className="speechBubbleSm blueBox position-relative mb-2 ms-auto" data-bs-toggle="modal"
                    data-bs-target="#commentModal1">
                    <p className="dialogText position-absolute fs-5  text-secondary-2">社群氛圍非常好…
                    </p>
                    <svg className="dialogBox" width="220" height="70" viewBox="0 0 220 70" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <clipPath id="clip-path-11">
                        <path
                        d="M181.987 54.1342C180.801 59.4166 179.646 64.5736 178.491 69.723L179.428 69.9964C179.479 69.9394 179.54 69.8862 179.601 69.8369C186.298 64.79 193.005 59.7507 199.757 54.7456C200.284 54.3545 201.322 54.0089 202.062 53.9861C204.732 53.914 207.406 53.9671 210.081 53.9557C215.593 53.9406 220.03 50.5836 220 46.4557C219.959 41.1468 219.939 35.8341 219.929 30.5252C219.919 22.5657 219.929 20.6292 219.929 12.6697C219.929 10.8545 219.939 9.0431 219.929 7.2279C219.909 2.9861 215.978 0.0126583 210.334 0.00506332C200.927 -0.00632916 191.52 0.00506332 182.113 0.00506332C146.962 0.00506332 44.9432 0.00506332 9.79712 0.00506332C4.9644 0.00506332 1.32721 2.0709 0.273529 5.33295C0.0759735 5.94434 0.0101166 6.57473 0.0101166 7.20131C0.00505066 22.3571 0.00506592 31.486 0 46.6418C0 50.9633 3.99687 53.9558 9.80727 53.9596C44.1833 53.9596 145.427 53.9596 179.803 53.9596H181.799C181.921 53.9596 182.012 54.0393 181.992 54.1304L181.987 54.1342Z" />
                    </clipPath>
                    <path
                        d="M181.987 54.1342C180.801 59.4166 179.646 64.5736 178.491 69.723L179.428 69.9964C179.479 69.9394 179.54 69.8862 179.601 69.8369C186.298 64.79 193.005 59.7507 199.757 54.7456C200.284 54.3545 201.322 54.0089 202.062 53.9861C204.732 53.914 207.406 53.9671 210.081 53.9557C215.593 53.9406 220.03 50.5836 220 46.4557C219.959 41.1468 219.939 35.8341 219.929 30.5252C219.919 22.5657 219.929 20.6292 219.929 12.6697C219.929 10.8545 219.939 9.0431 219.929 7.2279C219.909 2.9861 215.978 0.0126583 210.334 0.00506332C200.927 -0.00632916 191.52 0.00506332 182.113 0.00506332C146.962 0.00506332 44.9432 0.00506332 9.79712 0.00506332C4.9644 0.00506332 1.32721 2.0709 0.273529 5.33295C0.0759735 5.94434 0.0101166 6.57473 0.0101166 7.20131C0.00505066 22.3571 0.00506592 31.486 0 46.6418C0 50.9633 3.99687 53.9558 9.80727 53.9596C44.1833 53.9596 145.427 53.9596 179.803 53.9596H181.799C181.921 53.9596 182.012 54.0393 181.992 54.1304L181.987 54.1342Z"
                        fill="white" stroke="#487181" strokeWidth="4" clipPath="url(#clip-path-11)" />
                    </svg>

                </div>
            </div>
        </div>
          {/* <%- include('./layout/indexModal.ejs'); -%> */}
    </section>
      {/* <!-- 課程照片Swiper --> */}
    <PhotoSwiper />
</main>
<HomeModal />
    </>)
}